app/Controllers/Carrito_controller.php

SELECT *
FROM `productos`
WHERE `productos`.`id` = '2'
UPDATE `productos` SET `stock` = 29
WHERE `productos`.`id` IN ('2')
---

            // Actualizar stock del producto
            $Producto_model = new Productos_model();
            $producto = $Producto_model->find($item['id']); // Asegúrate de usar el método correcto para obtener datos

            if ($producto && isset($producto['stock'])) {
                $stock_edit = $producto['stock'] - $item['qty'];
                $Producto_model->update($item['id'], ['stock' => $stock_edit]);