app/Models/Cabecera_model.php

SELECT `d`.`id`, `d`.`nombre`, `u`.`cantidad`, `u`.`precio`, `u`.`total`
FROM `ventas_detalle` `u`
JOIN `productos` `d` ON `u`.`producto_id` = `d`.`id`
WHERE `u`.`venta_id` = '58'
---
     public function getDetallesVenta($idVenta)
     {
         $db = db_connect();
         $builder = $db->table('ventas_detalle u');
         $builder->select('d.id, d.nombre, u.cantidad, u.precio, u.total');
         $builder->where('u.venta_id', $idVenta);
         $builder->join('productos d', 'u.producto_id = d.id');
         $result = $builder->get();