app/Models/Clientes_model.php

SELECT *
FROM `cliente`
---
    public function getClientes(){

        return $this->findAll();