app/Models/Productos_model.php

SELECT *
FROM `productos`
WHERE `eliminado` = 'NO'
---
    public function getProdBaja($eliminado){

    	return $this->where('eliminado',$eliminado)->findAll();

SELECT *
FROM `productos`
WHERE `id` = '4'
 LIMIT 1
---
    public function getProducto($id){

    	return $this->where('id',$id)->first($id);