app/Models/Sesion_model.php

    public function getSesionesConUsuarios()
    {
        return $this->select('sesiones.id_sesion, sesiones.inicio_sesion, sesiones.fin_sesion, sesiones.estado, usuarios.nombre, usuarios.apellido')
            ->join('usuarios', 'usuarios.id = sesiones.id_usuario')
            ->orderBy('sesiones.id_sesion', 'DESC') // Ordena por id_sesion de mayor a menor
            ->get()
            ->getResult();
---
SELECT `sesiones`.`id_sesion`, `sesiones`.`inicio_sesion`, `sesiones`.`fin_sesion`, `sesiones`.`estado`, `usuarios`.`nombre`, `usuarios`.`apellido`
FROM `sesiones`
JOIN `usuarios` ON `usuarios`.`id` = `sesiones`.`id_usuario`
ORDER BY `sesiones`.`id_sesion` DESC

    public function buscarYFiltrar($filter)
    {
        // Usar el Query Builder del modelo
    return $this->db->table('sesiones')
    ->select('sesiones.id_sesion, sesiones.inicio_sesion, sesiones.fin_sesion, sesiones.estado, usuarios.nombre, usuarios.apellido')
    ->join('usuarios', 'usuarios.id = sesiones.id_usuario', 'left') // Unir con la tabla usuarios
    ->where('sesiones.estado', $filter) // Filtrar por estado
    ->orderBy('sesiones.id_sesion', 'DESC') // Ordena por id_sesion de mayor a menor
    ->get()
    ->getResult();
---
SELECT `sesiones`.`id_sesion`, `sesiones`.`inicio_sesion`, `sesiones`.`fin_sesion`, `sesiones`.`estado`, `usuarios`.`nombre`, `usuarios`.`apellido`
FROM `sesiones`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `sesiones`.`id_usuario`
WHERE `sesiones`.`estado` = 'activa'
ORDER BY `sesiones`.`id_sesion` DESC