app/Models/Usuarios_model.php

    public function getUsuario($id){

    	return $this->where('id',$id)->first($id);
---
SELECT *
FROM `usuarios`
WHERE `id` = '1'
 LIMIT 1

    public function getUsBaja($baja){

    	return $this->where('baja',$baja)->findAll();
---
SELECT *
FROM `usuarios`
WHERE `baja` = 'NO'